<?php

use Illuminate\Database\Seeder;

class ProfileTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
 ['name'=>'Аллерголог'],
['name'=>'Генетик'],
['name'=>'Гинеколог'],
['name'=>'Дерматолог'],
['name'=>'Диетолог'],
['name'=>'Косметолог'],
['name'=>'Логопед'],
['name'=>'ЛОР'],
['name'=>'Маммолог'],
['name'=>'Массажист'],
['name'=>'Невролог'],
['name'=>'Педиатр'],
['name'=>'Психолог'],
['name'=>'Психотерапевт'],
['name'=>'Стоматолог'],
['name'=>'Терапевт'],
['name'=>'Уролог'],
['name'=>'Хирург'],
['name'=>'Эндокринолог'],
['name'=>'Психиатр'],
['name'=>'Детский аллерголог'],
['name'=>'Детский гастроэнтероло'],
['name'=>'Детский гинеколог-эндокринолог'],
['name'=>'Детский дерматолог'],
['name'=>'Детский кардиолог'],
['name'=>'Детский ЛОР'],
['name'=>'Детский нефролог'],
['name'=>'Детский психиатр'],
['name'=>'Детский психолог'],
['name'=>'Детский стоматолог'],
['name'=>'Детский уролог'],
['name'=>'Детский хирург']
        ];
        DB::table('profiles')->insert($data);
    }
}
